// utils/Response.js

function Response(statusCode, message = null, details = null, extras = {}) {
  const messagesKK = {
    // ✅ Informational 1xx
    100: 'Жалғастыру',
    101: 'Хаттамаларды ауыстыру',
    102: 'Өңделуде',
    103: 'Ерте ақпарат',

    // ✅ Success 2xx
    200: 'Жарайды',
    201: 'Жасалды',
    202: 'Қабылданды',
    203: 'Басқа ақпарат',
    204: 'Мазмұн жоқ',
    205: 'Мазмұнды қалпына келтіру',
    206: 'Жартылай мазмұн',
    207: 'Көп мәртелі күй',
    208: 'Бұрын есептелген',
    226: 'IM пайдаланылды',

    // ✅ Redirection 3xx
    300: 'Бірнеше таңдау',
    301: 'Тұрақты түрде ауыстырылды',
    302: 'Уақытша ауыстырылды',
    303: 'Басқаға бағыттау',
    304: 'Өзгеріс жоқ',
    305: 'Прокси арқылы қол жеткізу',
    307: 'Уақытша қайта бағыттау',
    308: 'Тұрақты қайта бағыттау',

    // ✅ Client Error 4xx
    400: 'Сұраныс қате немесе дұрыс емес форматта',
    401: 'Аутентификация қажет',
    402: 'Төлем қажет',
    403: 'Рұқсат жоқ',
    404: 'Ресурс табылмады',
    405: 'Рұқсат етілмеген сұраныс әдісі',
    406: 'Қабылданбайды',
    407: 'Прокси аутентификация қажет',
    408: 'Сұраныс уақыты аяқталды',
    409: 'Қайшылық пайда болды',
    410: 'Жойылған',
    411: 'Ұзындық қажет',
    412: 'Алдын ала шарт орындалмады',
    413: 'Мазмұн тым үлкен',
    414: 'URI тым ұзын',
    415: 'Қолдау көрсетілмейтін медиа түрі',
    416: 'Ауқым қанағаттандырылмайды',
    417: 'Күту сәтсіз аяқталды',
    418: 'Мен шәйнекпін ☕',
    421: 'Қате бағытталған сұраныс',
    422: 'Өңделмейтін субъект',
    423: 'Блокталған',
    424: 'Тәуелділік сәтсіз аяқталды',
    425: 'Тым ерте',
    426: 'Жаңарту қажет',
    428: 'Алдын ала шарт қажет',
    429: 'Сұраныс тым жиі жіберілді',
    431: 'Тақырып өрістері тым үлкен',
    451: 'Құқықтық себеппен қолжетімсіз',

    // ✅ Server Error 5xx
    500: 'Ішкі сервер қатесі',
    501: 'Іске асырылмаған',
    502: 'Жарамсыз шлюз',
    503: 'Қызмет уақытша қолжетімсіз',
    504: 'Шлюз уақыты аяқталды',
    505: 'HTTP нұсқасы қолдау көрсетілмейді',
    506: 'Вариант келісілмеген',
    507: 'Жеткілікті сақтау жоқ',
    508: 'Шексіз цикл анықталды',
    510: 'Кеңейту қажет',
    511: 'Желі аутентификациясы қажет',
  };

  const retValue={
    status: statusCode,
    message: (message?  message : ''),
    ...(details ? { details } : {}),
    ...(Object.keys(extras).length ? extras : {}),};

    if(statusCode>199 && statusCode<300){
      retValue.success = messagesKK[statusCode] || 'Сәтті болды';
    }
    else{
      retValue.error = messagesKK[statusCode] || 'Ішкі қате';
    }
  return {...retValue}
}

module.exports = Response;
